# Limpieza de Datos

Cargamos nuestras librerias basicas.

In [28]:
import os
import glob
from pathlib import Path

In [29]:
import numpy as np
import pandas as pd

Tenemos nuestro datos en la carpeta 'Data' del proyecto

In [30]:
BASE_DIR = Path.cwd().parent
BASE_DIR

WindowsPath('C:/Users/Reymu/Desktop/Ciencia de datos/Datos (pandas)/Proyectos')

In [31]:
#para generar una lista de los archivos que indicamos con glob
[Path(filename).name for filename in glob.glob(f"{BASE_DIR / 'linkedln/data/*.csv'}")]

['job_postings.csv']

In [32]:
##Cargamos el archivo, importante monitorear tu ram
#%%time
data = pd.read_csv(BASE_DIR / 'linkedln/data/job_postings.csv')

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15886 entries, 0 to 15885
Data columns (total 27 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   job_id                      15886 non-null  int64
 1   company_id                  15520 non-null  float64
 2   title                       15886 non-null  object
 3   description                 15885 non-null  object
 4   max_salary                  5521 non-null   float64
 5   med_salary                  981 non-null    float64
 6   min_salary                  5521 non-null   float64
 7   pay_period                  6502 non-null   object
 8   formatted_work_type         15886 non-null  object
 9   location                    15886 non-null  object
 10  applies                     8700 non-null   float64
 11  original_listed_time        15886 non-null  float64
 12  remote_allowed              2340 non-null   float64
 13  views                       13123 non-null  float64
 14  job_posting_url             15886 non-null  object
 15  application_url             9795 non-null   object
 16  application_type            15886 non-null  object
 17  expiry                      15886 non-null  float64
 18  closed_time                 928 non-null    float64
 19  formatted_experience_level  10984 non-null  object
 20  skills_desc                 144 non-null    object
 21  listed_time                 15886 non-null  float64
 22  posting_domain              9044 non-null   object
 23  sponsored                   15886 non-null  int64
 24  work_type                   15886 non-null  object
 25  currency                    6502 non-null   object
 26  compensation_type           6502 non-null   object
dtypes: float64(11), int64(2), object(14)
memory usage: 3.3+ MB

In [34]:
#Podemos revisar cuanta memoria utilizamos
data.memory_usage(deep=True)

Index                               128
job_id                           127088
company_id                       127088
title                           1407019
description                   107172731
max_salary                       127088
med_salary                       127088
min_salary                       127088
pay_period                       709997
formatted_work_type             1046636
location                        1129273
applies                          127088
original_listed_time             127088
remote_allowed                   127088
views                            127088
job_posting_url                 2001628
application_url                 1885782
application_type                1134218
expiry                           127088
closed_time                      127088
formatted_experience_level       924256
skills_desc                      660199
listed_time                      127088
posting_domain                   929873
sponsored                        127088
work_type                       1046636
currency                         690408
compensation_type                742424
dtype: int64

## Datos de muestra.

En caso de que nuestros conjuntos de datos son grandes podemosa trabajar con unos datos de muestra

In [35]:
#sample(filas, semilla del random)
sample_df = data.sample(8000, random_state=101)

In [36]:
sample_df.head()

,job_id,company_id,title,description,max_salary,med_salary,min_salary,pay_period,formatted_work_type,location,...,expiry,closed_time,formatted_experience_level,skills_desc,listed_time,posting_domain,sponsored,work_type,currency,compensation_type
11267,3699089065,283807.0,Maintenance Technician,"Job Overview: \nAs a Maintenance Staff Member,...",NaN,22.00,NaN,HOURLY,Full-time,"Fort Myers, FL",...,1.700000e+12,NaN,Entry level,NaN,1.690000e+12,myjobs.adp.com,0,FULL_TIME,USD,BASE_SALARY
9896,3699052941,89877420.0,Accountant,Overview\nThe Accountant assists with accounti...,85000.0,NaN,55000.0,YEARLY,Full-time,United States,...,1.700000e+12,NaN,Mid-Senior level,NaN,1.690000e+12,careers.vectrus.com,0,FULL_TIME,USD,BASE_SALARY
11275,3699089155,15656.0,Project Manager IV,"\nCompany Description\n \nAt AECOM, we’re deli...",NaN,NaN,NaN,NaN,Full-time,"Coral Gables, FL",...,1.700000e+12,NaN,Mid-Senior level,NaN,1.690000e+12,rr.jobsyn.org,0,FULL_TIME,NaN,NaN
5915,3694101293,10126963.0,Sr. Media Relations Specialist,Sr. Media Relations Strategist\nLocation: Chic...,NaN,NaN,NaN,NaN,Full-time,"Chicago, IL",...,1.700000e+12,NaN,Mid-Senior level,NaN,1.690000e+12,NaN,1,FULL_TIME,NaN,NaN
3018,3693061971,28893.0,Full-time Store Supervisor - Plaza Bonita 0753,Overview\n\nThe FT Store Supervisor position w...,NaN,16.75,NaN,HOURLY,Full-time,"National City, CA",...,1.700000e+12,NaN,Mid-Senior level,NaN,1.690000e+12,retail-forever21-sparcgroup.icims.com,1,FULL_TIME,USD,BASE_SALARY

In [37]:
sample_df.columns
#en caso de tener columnas con nombres muy grandes podemos realizar un renombre de las columnas
#crear un lista con los nombres y se las asignas
#columns = ['nombre', 'nombre'....]
#sample_df.columns=columns

Index(['job_id', 'company_id', 'title', 'description', 'max_salary',
       'med_salary', 'min_salary', 'pay_period', 'formatted_work_type',
       'location', 'applies', 'original_listed_time', 'remote_allowed',
       'views', 'job_posting_url', 'application_url', 'application_type',
       'expiry', 'closed_time', 'formatted_experience_level', 'skills_desc',
       'listed_time', 'posting_domain', 'sponsored', 'work_type', 'currency',
       'compensation_type'],
      dtype='object')

# Seleccioando la informacion relevante

In [80]:
#Revisamos las columnas y el cotenido
data.count(axis=0)
#data['compensation_type']

job_id                        15886
company_id                    15520
title                         15886
description                   15885
max_salary                     5521
med_salary                      981
min_salary                     5521
pay_period                     6502
formatted_work_type           15886
location                      15886
applies                        8700
original_listed_time          15886
remote_allowed                 2340
views                         13123
job_posting_url               15886
application_url                9795
application_type              15886
expiry                        15886
closed_time                     928
formatted_experience_level    10984
skills_desc                     144
listed_time                   15886
posting_domain                 9044
sponsored                     15886
work_type                     15886
currency                       6502
compensation_type              6502
dtype: int64

In [87]:
#Aplicamos filtro para obtener las columnas relevantes 
data_filter=data.iloc[:][['title', 'max_salary','min_salary', 'applies', 'views']]

data_filter.sort_values('views', ascending=False)

                            title  max_salary  min_salary  applies   views
686      Customer Success Manager    146000.0   115000.00   1420.0  5656.0
1770     Junior Software Engineer         NaN         NaN   1615.0  3657.0
470               President / CEO         NaN         NaN    149.0  3453.0
14118              Vice President         NaN         NaN    253.0  2599.0
14258         Executive Assistant         NaN         NaN      NaN  2570.0
...                           ...         ...         ...      ...     ...
15842       Sanitation Technician         NaN         NaN      NaN     NaN
15845                        Chef        26.0       20.68      NaN     NaN
15856                        Cook         NaN         NaN      NaN     NaN
15861  Field Sales Representative         NaN         NaN      NaN     NaN
15880       Sanitation Technician         NaN         NaN      NaN     NaN

[15886 rows x 5 columns]

### Gráficos
Buscamos la forma de representar la informacion de manera que nos sea más facil de digerir.

In [109]:
#Nos importa buscar empleos que contengan palabra clave como: data, developer, software
interes_df=data_filter[ data_filter['title'].str.contains('Data|Software|Developer', case=False)]
print(interes_df)
#Al usar case=False no discrimanos entre mayusculas y minusculas

                                           title  max_salary  min_salary  \
35                        Lead Software Engineer    190000.0    160000.0
69                            Teradata Developer         NaN         NaN
82                             Software Engineer         NaN         NaN
118       Senior Business Intelligence Developer       150.0       100.0
128    Staff Perception Software Engineer, CV/ML         NaN         NaN
...                                          ...         ...         ...
15788  Netsuite Developer Administrator - Remote         NaN         NaN
15792                   Senior Software Engineer         NaN         NaN
15813                  OCM Data Analyst (Remote)     88000.0     85000.0
15836           Senior Supply Chain Data Analyst    108000.0     76000.0
15877                     An, Database Developer         NaN         NaN

       applies  views
35         1.0   10.0
69        13.0   56.0
82        67.0  158.0
118       41.0  155.0
128        9.0   69.0
...        ...    ...
15788      4.0   33.0
15792      NaN  389.0
15813     47.0  165.0
15836     21.0  122.0
15877     15.0   76.0

[983 rows x 5 columns]

### Guardamos los resultados

In [113]:
#Se recomienda guardar en formato parquet ya que es multiplataforma, optimiza el tiempo de carga y memoria.
interes_df.to_csv(BASE_DIR / "linkedln/data/PROCESADO.csv")